20260127084006-all_treks_details.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>all treks details</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">all treks details</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga0bff35">to be edited</a>
<ul>
<li><a href="#org079c172">Kalsubai Peak – 29 Dec 2024</a></li>
<li><a href="#orgbfb1b3a">Dehergad (Bhorgad) Fort – 2025</a></li>
<li><a href="#org7a73701">Borgad Jungle Safari – 11 Oct 2025</a></li>
<li><a href="#org2f3d230">Panjrapole Chunchele Farm Jungle Safari – 20 Sep 2025</a></li>
<li><a href="#org9a8c112">Daryai Mata Mandir Trek – 4 Oct 2025</a></li>
<li><a href="#org595143f">Mayna Parvat (Gavlawadi, Makhmalabad) – 18 Oct 2025</a></li>
<li><a href="#orga73080b">Sula Dongar – 25 Oct 2025</a></li>
<li><a href="#orge5e68cb">Chamar Leni – 1 Nov 2025</a></li>
<li><a href="#org735022d">Ramshej Fort – 8 Nov 2025</a></li>
<li><a href="#org84e3e41">Pandav Leni – 15 Nov 2025</a></li>
<li><a href="#org466569e">Gadgad Sangvi – 22 Nov 2025</a></li>
<li><a href="#org66c7db6">Raygadnagar Tekdi – 6 Dec 2025</a></li>
<li><a href="#org6df0f73">Ghalna Fort – 21 Dec 2025</a></li>
</ul>
</li>
<li><a href="#orgf02b8d9">kavnai trek 31 jan 2026</a></li>
<li><a href="#orgfc1b1f6">trek notes template</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga0bff35" class="outline-2">
<h2 id="orga0bff35">to be edited</h2>
<div class="outline-text-2" id="text-orga0bff35">
</div>
<div id="outline-container-org079c172" class="outline-3">
<h3 id="org079c172">Kalsubai Peak – 29 Dec 2024</h3>
<div class="outline-text-3" id="text-org079c172">
<ul class="org-ul">
<li>Region: Kalsubai–Harishchandragad Wildlife Sanctuary, Ahmednagar district.</li>
<li>Height: 1646 m / 5400 ft (highest peak of Maharashtra).</li>
<li>Grade: Moderate; long climb with iron ladders, suitable for fit beginners.</li>
<li>Route: Standard Bari village route; fields → gradual slope → multiple iron ladders → summit temple plateau.</li>
<li>Trek time: ~3–4 hrs ascent, 2–3 hrs descent; total 6–7 hrs with breaks.</li>
<li>Access: Drive/bus to Bari from Nashik via Ghoti–Bhandardara side; paid parking in village.</li>
<li>Best season: Oct–Feb for views; monsoon for clouds (more slippery).</li>
<li>Water/food: Carry 2–3 L water; stalls with tea/poha often present in season, but don’t depend fully.</li>
<li>Safety: Start pre-dawn for sunrise; ladders can jam on weekends; rock &amp; metal are very slippery in rain.</li>
<li>Fact: From the top you can see Harishchandragad, Ratangad and other major Sahyadri peaks on a clear day.</li>
<li>Quote: “Climbing Kalsubai doesn’t just raise your altitude, it quietly raises your standards for what you can do.”</li>
</ul>
</div>
</div>

<div id="outline-container-orgbfb1b3a" class="outline-3">
<h3 id="orgbfb1b3a">Dehergad (Bhorgad) Fort – 2025</h3>
<div class="outline-text-3" id="text-orgbfb1b3a">
<ul class="org-ul">
<li>Region: Near Nashik, in the Peth range of the Western Ghats.[web:15]</li>
<li>Height: ~1000 m / ~3297 ft (approx).</li>
<li>Grade: Easy–Moderate; mostly forested trail with a final rocky section near the fort structures.</li>
<li>Route: Forest entry → gentle jungle trail → a couple of steeper forested climbs → open ridge with views → ruined fort walls/structure.[web:10]</li>
<li>Trek time: 2–3 hrs ascent, 1.5–2 hrs descent.</li>
<li>Access: From Nashik by road towards Peth region; local guidance is very helpful because of similar-looking forest tracks.[web:15]</li>
<li>Best season: Post-monsoon to winter; monsoon makes the forest lush but also more leech-prone and slippery.</li>
<li>Water/food: No reliable water on trail; carry full requirement from base (2–3 L); food only in nearby villages, so tiffin is best.</li>
<li>Safety: Forest sections can be confusing; stay with group and avoid venturing off-track; watch for loose soil and leaf-covered stones.</li>
<li>Fact: Dehergad/Bhorgad area is part of a reforestation and biodiversity recovery story where local efforts helped bring back green cover and wildlife.[web:7][web:11]</li>
<li>Quote: “Some forts roar with crowds, others like Dehergad whisper through trees and broken stones.”</li>
</ul>
</div>
</div>

<div id="outline-container-org7a73701" class="outline-3">
<h3 id="org7a73701">Borgad Jungle Safari – 11 Oct 2025</h3>
<div class="outline-text-3" id="text-org7a73701">
<ul class="org-ul">
<li>Region: Near Nashik, reforested hill and forest area.[web:7][web:11]</li>
<li>Height: ~3480 ft (approx summit ridge).</li>
<li>Grade: Easy; usually done as a jungle walk/safari rather than a summit push.</li>
<li>Route: Entry point → forest track → viewpoints over reforested slopes and small water bodies; specific paths vary by guide and permission.</li>
<li>Access: Close to Nashik city; access only through organised groups and with special permission due to proximity to restricted areas.</li>
<li>Best season: Post-monsoon for full green cover.</li>
<li>Water/food: Treat as a half-day walk but still carry water and light snacks.</li>
<li>Safety: Area touches sensitive/IAF-linked zones; always respect boundaries, follow guides, and avoid off-trail wandering.</li>
<li>Fact: Around 1.5–2.5 lakh trees have been planted here over years as part of major afforestation drives, transforming the hill’s biodiversity.[web:7][web:11]</li>
<li>Quote: “Borgad is a reminder that forests can be destroyed by people—and also rebuilt by people.”</li>
</ul>
</div>
</div>

<div id="outline-container-org2f3d230" class="outline-3">
<h3 id="org2f3d230">Panjrapole Chunchele Farm Jungle Safari – 20 Sep 2025</h3>
<div class="outline-text-3" id="text-org2f3d230">
<ul class="org-ul">
<li>Region: Shree Nasik Panchavati Panjrapole farm area near Chunchale, Nashik.[web:35]</li>
<li>Grade: Easy safari-style outing; done by vehicle plus short walks.</li>
<li>Area: ~850 acres of land with trees, water bodies, grazing land and farm sections (as mentioned in your notes).</li>
<li>Route: Internal farm/forest tracks by tractor/jeep; short walks to view cattle, birds, small water bodies and plantation areas.</li>
<li>Access: Only with prior permission from Nasik Panchavati Panjrapole; not an open public trekking trail.</li>
<li>Best season: Post-monsoon to winter for pleasant weather and greenery.</li>
<li>Water/food: Typically includes organised snacks/tea; still carry a bottle and personal essentials.</li>
<li>Safety: Respect animals’ space; do not litter or feed without permission; this is a working gaushala and agri-tourism site.</li>
<li>Fact: The farm hosts hundreds of cattle and a mix of horticulture, composting, and other agri-based projects, blending animal care with green initiatives.[web:35]</li>
<li>Quote: “Not every jungle is wild—some are carefully grown, one sapling and one animal at a time.”</li>
</ul>
</div>
</div>

<div id="outline-container-org9a8c112" class="outline-3">
<h3 id="org9a8c112">Daryai Mata Mandir Trek – 4 Oct 2025</h3>
<div class="outline-text-3" id="text-org9a8c112">
<ul class="org-ul">
<li>Region: Dari Matori area, near Makhmalabad–Nashik belt.[web:32]</li>
<li>Grade: Easy; short morning trek plus valley/temple visit.</li>
<li>Route: Small approach path from road/parking → gradual trail towards the temple area → viewpoints over valley, stream sections in season.</li>
<li>Trek time: ~1.5–2.5 hrs including photo and rest stops.</li>
<li>Access: Short drive from Nashik; popular with local groups as a “small trek but full experience.”</li>
<li>Best season: Monsoon and post-monsoon for water flow and lush greenery; winter for clear skies.</li>
<li>Water/food: Carry your own water and a tiffin; sometimes villagers sell tea/snacks, but not guaranteed.</li>
<li>Safety: Rocks near water get slippery; watch footing around streams and edges; keep group together as paths branch.</li>
<li>Fact: The combination of small temple, moving water and valley views makes it feel like a full trek “compressed” into a short distance.</li>
<li>Quote: “Daryai Mata proves you don’t need a huge altitude gain to feel a big shift inside.”</li>
</ul>
</div>
</div>
