20260127084006-all_treks_details.html

<div id="outline-container-org6df0f73" class="outline-3">
<h3 id="org6df0f73">Ghalna Fort – 21 Dec 2025</h3>
<div class="outline-text-3" id="text-org6df0f73">
<ul class="org-ul">
<li>Region: Near Malegaon, north-east of Nashik, in the Satmala / adjoining range.[web:14]</li>
<li>Height: ~1000+ m class fort (similar to many mid-sized Sahyadri forts).[web:14]</li>
<li>Grade: Moderate; good path but sustained climb, with historic gateways and structures en route.</li>
<li>Route: Ghalna village → trail from Gorakshanath/Shivpanchayatan temple at base → climb to first stone gateway (parkoat) with carvings → further gateways including iron gate and later “Lakhya Darwaza” style entrance → top plateau with mosque, hause (water tanks), ruined structures and remains of Ambarkhana and offices.[web:10][web:14]</li>
<li>Trek time: ~1.5–2 hrs ascent depending on crowd; similar for descent; your event day included long exploration and demonstrations.</li>
<li>Access: From Nashik via Malegaon road, then internal rural road to Ghalna village; your trek was a big organised event with 6 buses and ~300 trekkers.</li>
<li>Best season: Post-monsoon to winter; summer heats the rock heavily.</li>
<li>Water/food: Carry full day’s water (4–5 L as advised by organisers) and tiffin; no dependable facilities on top.</li>
<li>Safety: Big groups must be disciplined at gateways and narrow sections; crowd control and sticking to marked path is important.</li>
<li>History/fact: Ghalna’s multiple carved gateways, Persian inscription, mosque and large tanks reflect its layered history across Sultanate, Mughal and British periods.[web:10][web:14]</li>
<li>Personal note: This was part trek, part cultural event with “gadadhari” demonstrations, Shivaji-era martial vibes, and a strong sense of shared history.</li>
<li>Quote: “On Ghalna, every gateway feels like a checkpoint between centuries.”</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf02b8d9" class="outline-2">
<h2 id="orgf02b8d9"><a href="20260131135705-kavnai_trek_31_jan_2026.html#ID-8c3e6cad-40c4-49ff-a042-913a715289b0">kavnai trek 31 jan 2026</a></h2>
</div>
<div id="outline-container-orgfc1b1f6" class="outline-2">
<h2 id="orgfc1b1f6"><a href="20260131140313-trek_notes_template.html#ID-d5c52ebd-667f-4226-b116-d3bf22840997">trek notes template</a></h2>
</div>
</div>
</body>
</html>